# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-seg-p6-ca instance segmentation model with P3/8 - P6/64 outputs and Coordinate Attention
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/segment
# CA (Coordinate Attention) Reference: https://arxiv.org/abs/2103.02907

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg-p6-ca.yaml' will call yolov8-seg-p6-ca.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0x6 backbone with Coordinate Attention
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CoordAtt, []] # 5-CA attention for P3
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, CoordAtt, []] # 8-CA attention for P4
  - [-1, 1, Conv, [768, 3, 2]] # 9-P5/32
  - [-1, 3, C2f, [768, True]]
  - [-1, 1, CoordAtt, []] # 11-CA attention for P5
  - [-1, 1, Conv, [1024, 3, 2]] # 12-P6/64
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CoordAtt, []] # 14-CA attention for P6
  - [-1, 1, SPPF, [1024, 5]] # 15

# YOLOv8.0x6 head with Coordinate Attention
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 11], 1, Concat, [1]] # cat backbone P5
  - [-1, 3, C2, [768, False]] # 18

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2, [512, False]] # 21

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2, [256, False]] # 24 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 21], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2, [512, False]] # 27 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 18], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2, [768, False]] # 30 (P5/32-large)

  - [-1, 1, Conv, [768, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P6
  - [-1, 3, C2, [1024, False]] # 33 (P6/64-xlarge)

  - [[24, 27, 30, 33], 1, Segment, [nc, 32, 256]] # Segment(P3, P4, P5, P6)

